OpenFOAM/testCase/mesh/backGround/0_org/include/frontBackTopBottomfreePatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

frontAndBack
{
    type empty;
}

topAndBottom
{
    type slip;
}

// ************************************************************************* //
